Revit 2027 API
AdaptiveComponentInstanceUtils.GetInstanceShapeHandlePointElementRefIds Method
 Gets Shape Handle Adaptive Point Element Ref ids to which the instance geometry adapts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetInstanceShapeHandlePointElementRefIds(
	FamilyInstance famInst
)
Public Shared Function GetInstanceShapeHandlePointElementRefIds (
	famInst As FamilyInstance
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetInstanceShapeHandlePointElementRefIds(
	FamilyInstance^ famInst
)
static member GetInstanceShapeHandlePointElementRefIds :
        famInst : FamilyInstance -> IList<ElementId>
Parameters
famInst FamilyInstance
 The FamilyInstance
Return Value
IList<ElementId>
 The Shape Handle Adaptive Point Element Ref ids to which the instance geometry adapts.
Exceptions
Exception | Condition
ArgumentException |  The FamilyInstance famInst is not an Adaptive Family Instance. -or- The FamilyInstance famInst does not have an Adaptive Family Symbol.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation failed.
Remarks
 The output contains shape handle point ref ids. If there are no shape handle points defined in the Family then the output is empty.
See Also
Reference
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace